using System.Collections;
using System.Collections.Generic;
using UnityEngine;

public class Combinations : MonoBehaviour
{
    public static Pair[][] Pairs;
    public class Pair
    {
        public int indexOfPair;
        public int indexOfChild;
        public Pair(int indexOfPair, int indexOfChild)
        {
            this.indexOfPair = indexOfPair;
            this.indexOfChild = indexOfChild;
        }
    }

    public int checkComb(int i1, int i2)
    {
        if (i1 > i2)
        {
            int tmp = i1;
            i1 = i2;
            i2 = tmp;
        }
        if(Pairs[i1] != null)
        {
            foreach(Pair p in Pairs[i1])
            {
                if(i2 == p.indexOfPair) { return p.indexOfChild; }
            }
        }
        return -1;
    }
    public void OnAwake()
    {
        Pairs = new Pair[][]
        {
            //0
            new Pair[]{ 
                new Pair(1, 4), //вода + огонь = пар
                new Pair(2, 5), //вода + камень = глина
                new Pair(3, 6), //вода + воздух = лед
                new Pair(7, 10), // вода + лава = обсидиан
                new Pair(9, 11), //0вода + 9песок = грязь
                new Pair(15, 16), // 0вода + 15вулкан = 16взрыв
                new Pair(17, 22), // 0вода + 17облако = 22дождь
                new Pair(30, 31), // 0вода + 30пустыня = 31саванна
                new Pair(27, 32), // 0вода + 27земля = 32луга
                new Pair(35, 36),// 0вода + 35кратер = 36озеро
                new Pair(20, 37),// 0вода + 20гора = 37река
                new Pair(40, 42),// 0вода + 40жизнь = 42животные(моллюск)
                new Pair(51, 59),// 51лес + 0вода = 59джунгли
                new Pair(19, 61), // 19цемент + 0вода = 61бетон
                new Pair(57, 59),// 57ящерица + 0вода = 94саламандра
                new Pair(28, 100),// 28железо + 0вода = 100ржавчина
            },
            //1
            new Pair[]{
                new Pair(2, 7), //огонь + камень = 7лава
                new Pair(3, 8), //огонь + воздух = 8свет
                new Pair(5, 12),// 1огонь + 5глина = 12керамик
                new Pair(9, 18),// 1огонь + 9песок = 18стекло
                new Pair(38, 39),// 1огонь + 38океан = 39соль
                new Pair(46, 52),// 46дерево + 1огонь = 52уголь
                new Pair(74, 85),// 74обезьяна + 1огонь = 85человек
                new Pair(84, 85),// 84неандерталец + 1огонь = 85человек
                new Pair(57, 93),// 57ящерица + 1огонь = 93дракон
                new Pair(58, 93),// 58динозавр + 1огонь = 93дракон
            },
            //2
            new Pair[]{ 
                new Pair(3, 9), // камень + воздух = 9песок
                new Pair(6, 14),// 2камень + 6лед = 14комета
                new Pair(7, 15),// 2камень + 7лава = 15вулкан
            },
            //3
            new Pair[]{
                 new Pair(4, 17),// 3воздух + 4пар = 17облако
                 new Pair(20, 21),// 3воздух + 20гора = 21ветер
                 new Pair(25, 26), // 3воздух + 25астероид = 26метеорит
                 new Pair(14, 26), // 3воздух + 14комета = 26метеорит
            },
            //4
            null,
            //5
            new Pair[]{
                 new Pair(9, 19),// 5глина + 9песок = 19цемент
                 new Pair(11, 27), // 5глина + 11грязь = 27земля
            },
            //6
            new Pair[]{
                 new Pair(15, 20),// 6лед + 15вулкан = 20гора
                 new Pair(22, 34), // 6лед + 22дождь = 6снег
            },
            //7
            new Pair[]{
                new Pair(9, 13), //7лава + 9песок = 13руда
            },
            //8
            new Pair[]{
                new Pair(22, 24),// 8свет + 22дождь = 24радуга
                new Pair(9, 30),// 8свет + 9песок = 30пустыня
                new Pair(31, 32),// 8свет/31саванна + 32луга = 44равнина
                new Pair(38, 40),// 8свет + 38океан = 44бактерия
            },
            //9
            new Pair[]{
                new Pair(54, 99),// 54электричество + 9песок = 99алюминий
            },
            //10
            null,
            //11
            null,
            //12
            new Pair[]{
                new Pair(19, 62),// 19цемент + 12керамика = 62кирпич
                new Pair(65, 66),// 65окно + 12керамика = 66дом
            },
            //13
            new Pair[]{
                 new Pair(14, 25),// 13руда + 14комета = 25астероид
                 new Pair(27, 28),// 13руда + 27земля = 28железо
                 new Pair(54, 98),// 54электричество + 13руда = 98медь
            },
            //14
            new Pair[]{
                 new Pair(27, 26),// 27земля + 14комета = 26метеорит
            },
            //15
            new Pair[]{
                 new Pair(58, 60),// 58динозавры + 15вулкан = 60мышка
            },

            //16
            null,
            //17
            null,
            //18
             
            new Pair[]{
                 new Pair(64, 65),// 64стена + 18стекло = 65окно (дом 3/4)
            },

            //19
            null,
            //20

            new Pair[]{
                 new Pair(22, 37),// 20гора + 22дождь = 37река
                 new Pair(60, 75),// 60млекопитающие + 20гора = 75овца
                 new Pair(68, 82),// 68лев + 20гора = 82барс
                 new Pair(74, 84), // 74обезьяна + 20гора = 84неандерталец
                 new Pair(85, 91),// 85человек + 20гора = 91пастух
            },

            //21
            new Pair[]{
                 new Pair(22, 23),// 21ветер + 22дождь = 23гроза
            },

            //22
            new Pair[]{
                 new Pair(30, 31),// 22дождь + 30пустыня = 31саванна
                 new Pair(27, 32),// 22дождь + 27земля = 32луга
                 new Pair(32, 33),// 22дождь + 32луга = 33болото
                 new Pair(35, 36),// 22дождь + 35кратер = 36озеро
                 new Pair(51, 59),// 51лес + 22дождь = 59джунгли
            },          

            //23

            new Pair[]{
                 new Pair(28, 29), // 23гроза + 28железо = 29молния
            },

            //24
            null,
            //25
            new Pair[]{
                 new Pair(27, 26),// 27земля + 25астероид = 26метеорит
            },
            //26

            new Pair[]{
                 new Pair(32, 35),// 26метеорит + 32луга = 35кратер
                 new Pair(31, 35),// 26метеорит + 31саванна = 35кратер
                 new Pair(30, 35),// 26метеорит + 30пустыня = 35кратер
                 new Pair(58, 60),// 58динозавры + 26метеорит = 60мышка
            },   

            //27

            new Pair[]{
                 new Pair(40, 41), // 27земля + 40жизнь = 41мох
            },

            //28

            new Pair[]{
                 new Pair(52, 53),// 52уголь + 28железо = 53сталь
                 new Pair(54, 97),// 54электричество + 28железо = 97магнит
            },

            //29

            new Pair[]{
                 new Pair(53, 54), // 53сталь + 29молния = 54электричество
            },

            //30

            new Pair[]{
                 new Pair(38, 39),// 30пустыня + 38океан = 39соль
                 new Pair(41, 45),// 41растение + 30пустыня = 45кактус
                 new Pair(42, 57),// 42животное + 30пустыня = 57ящерица
                 new Pair(56, 57),// 56земноводные + 30пустыня = 57ящерица
                 new Pair(60, 67),// 60млекопитающие + 30пустыня = 67фенек
                 new Pair(68, 77),// 68лев + 30пустыня = 77кошка
            }, 

            //31

            new Pair[]{
                 new Pair(40, 41),//31саванна + 40жизнь = 41мох
                 new Pair(41, 46),// 41растение + 31саванна = 46дерево
                 new Pair(42, 58),// 42животные + 31саванна = 58динозавры
                 new Pair(57, 58),// 57пресмыкающиеся + 31саванна = 58динозавры
                 new Pair(60, 68),// 60млекопитающие + 31саванна = 68лев
                 new Pair(69, 79),//69корова + 31саванна = 79буйвол
                 new Pair(74, 84),// 74обезьяна + 31саванна = 84неандерталец
            }, 

            //32

            new Pair[]{
                 new Pair(40, 41),//32луга + 40жизнь = 41мох
                 new Pair(41, 47),//41растение + 32луга = 47цветок
                 new Pair(46, 51),//46дерево + 32луга = 51лес
                 new Pair(42, 58),//42животные + 32луга = 58динозавры
                 new Pair(57, 58),//57пресмыкающиеся + 32луга = 58динозавры
                 new Pair(60, 69),//60млекопитающие + 32луга = 69корова
                 new Pair(70, 83),//70заяц + 32луга = 83кролик
                 new Pair(85, 88),//85человек + 32луга = 88фермер
            }, 

            //33

            new Pair[]{
                 new Pair(40, 43),//33болото + 40жизнь = 43гриб(поганка)
                 new Pair(41, 48),//41растение + 33болото = 48ягоды
                 new Pair(42, 56),//42животное + 33болото = 56лягушка
                 new Pair(55, 56),//55рыбы + 33болото = 56лягушка
                 new Pair(60, 70),//60млекопитающие + 33болото = 70заяц
                 new Pair(85, 87),//85человек + 33болото = 87ведьма
            }, 

            //34

            new Pair[]{
                 new Pair(68, 82),// 68лев + 34снег = 82барс
            }, 
            
            //35
            null,
            //36

            new Pair[]{
                 new Pair(37, 38),// 36озеро + 37река = 38океан
                 new Pair(41, 49),//41растение + 36озеро = 49водоросли
                 new Pair(42, 55),//42животное + 36озеро = 55рыбы
                 new Pair(60, 71),//60млекопитающие + 36озеро = 71нерпа
            }, 

            //37

            new Pair[]{
                 new Pair(57, 94),// 57ящерица + 37река = 94саламандра
            },

            //38

            new Pair[]{
                 new Pair(40, 42),//38океан + 40жизнь = 42животные(моллюск)
                 new Pair(41, 50),// 41растение + 38океан = 50коралл
                 new Pair(42, 55),// 42животное + 38океан = 55рыбы
                 new Pair(60, 72),// 60млекопитающие + 38океан = 72кит
                 new Pair(85, 92),//85человек + 38океан = 92русалка
            }, 

            //39
            null,
            //40

            new Pair[]{
                 new Pair(38, 40),// 8свет + 38океан = 40бактерии
            },

            //41
            null,
            //42
            null,
            //43

            new Pair[]{
                 new Pair(51, 95), // 43гриб + 51лес = 95мухомор
                 new Pair(46, 96), // 43гриб + 46дерево = 96опята
            },

            //44

            new Pair[]{
                 new Pair(60, 76),// 60млекопитающие + 44равнина = 76лошадь
                 new Pair(69, 79),// 69корова + 44равнина = 79буйвол
                 new Pair(74, 84), // 74обезьяна + 44равнина = 84неандерталец
            },

            //45
            null,
            //46
            null,
            //47
            null,
            //48
            null,
            //49
            null,
            //50
            null,
            //51

            new Pair[]{
                 new Pair(60, 73),// 60млекопитающие + 51лес = 73волк
                 new Pair(67, 80),// 67фенек + 51лес = 80лиса
                 new Pair(68, 81),// 68лев + 51лес = 81рысь
                 new Pair(85, 89),// 85человек + 51лес = 89эльф
            },

            //52
            null,
            //53

            new Pair[]{
                 new Pair(61, 63), // 61бетон + 53сталь = 63фундамент (дом 1/4)
                 new Pair(54, 97), // 54электричество + 53сталь = 97магнит
            },

            //54
            null,
            //55
            null,
            //56
            null,
            //57
            null,
            //58
            null,
            //59

            new Pair[]{
                 new Pair(60, 74),// 60млекопитающие + 59джунгли = 74обезьяна
                 new Pair(68, 78),// 68лев + 59джунгли = 78тигр
                 new Pair(85, 90),// 85человек + 59джунгли = 90дикарь
            },

            //60
            null,
            //61
            null,
            //62

            new Pair[]{
                 new Pair(63, 64), // 63фундамент + 62кирпич = 64стена (дом 2/4)
            },

            //63
            null,
            //64
            null,
            //65
            null,
            //66

            new Pair[]{
                 new Pair(74, 85),// 74обезьяна + 66дом = 85человек
                 new Pair(84, 85),// 84неандерталец + 66дом = 85человек
                 new Pair(85, 86),// 85человек + 66дом = 86служанка
            },

            //67
            null,
            //68
            null,
            //69
            null,
            //70
            null,
            //71
            null,
            //72
            null,
            //73
            null,
            //74
            null,
            //75

            new Pair[]{
                 new Pair(85, 91), // 85человек + 75овца = 91пастух
            },

            //76
            null,
            //77
            null,
            //78
            null,
            //79
            null,
            //80
            null,
            //81
            null,
            //82
            null,
            //83
            null,
            //84
            null,
            //85
            null,
            //86
            null,
            //87
            null,
            //88
            null,
            //89
            null,
            //90
            null,
            //91
            null,
            //92
            null,
            //93
            null,
            //94
            null,
            //95
            null,
            //96
            null,
            //97
            null,
            //98
            null,
            //99
            null,
            //100
            null,
        };
    }
}
